# GetSpatialElementCalculationPoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..GetSpatialElementCalculationPoint Method
FamilyInstance Class See Also
---
Gets the location of the calculation point for this instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ GetSpatialElementCalculationPoint()
```

Visual Basic
---
```text
Public Function GetSpatialElementCalculationPoint As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetSpatialElementCalculationPoint()
```

# ### Return Value
A 3d point.
# Remarks
See HasSpatialElementCalculationPoint for reference.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if this instance does not have a single calculation point. |

# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace